; domain
;Header and description

(define (domain normalDelivery_no_fluents)

;remove requirements that are not needed
;(:requirements :strips :fluents :durative-actions :timed-initial-literals :typing :conditional-effects :negative-preconditions :duration-inequalities :equality ::disjunctive-preconditions)
(:requirements :typing :equality :negative-preconditions :disjunctive-preconditions)

(:types 
    robot - object
    location - object
    carrier - object
    crate - object
    person - object
    loc base - location
    food meds - crate
    amount - object
)
; crate counter function --> removed because :fluent
;(:functions
;    (crate_count ?k - carrier)
;)
; un-comment following line if constants are needed
(:constants
    operator - robot
    depot - base
    n0 - amount
)

(:predicates 
    ;crates
    (crate_at ?c - crate ?l - location)     ;crate ?c crate_at at location ?l
    ;(is_loaded ?c - crate)           ;crate unavailable because loaded 
    (is_delivered ?c - crate)                       ;crate unavailable because delivered

    ;robot
    (robot_at ?r - robot ?l - location)     ;robot ?r is at location ?l
    (is_empty ?r - robot)           ;robot ?r is empty
    
    ;people
    (person_at ?p - person ?l - location)       ;person ?p is at location ?l
    (served ?p - person ?c - crate)              ;person ?p has been served with crate ?c
    ;(needs ?p - person ?cont - content)            ;added as a result of OPTIC non-compatibility
    ;(not_needs ?p - person ?cont - content)

    ;carrier
    (carrier_at ?k - carrier ?l - location)
    (bearing ?k - carrier ?c - crate)         ;carrier ?k is bearing crate ?c

    ;predicates to avoid using fluents
    (add ?init_amount ?final_amount - amount)
    (pop ?orig_amount ?final_amount - amount)
    ;differentiate crate_count per carrier
    (crate_count ?k - carrier ?num_crates - amount)
)


;moves robot between two locations: ?from and ?to
;NOTE: crates of no kind are involved
(:action move
    :parameters (?r - robot ?k - carrier ?from - location ?to - loc )
    :precondition (and 
        (robot_at ?r ?from)
        (carrier_at ?k ?from)
        (not(=?from ?to))           ;this way carrier is forced to pick action back_to_base to reload 
    )
    :effect(and
        (not(robot_at ?r ?from))
        (not(carrier_at ?k ?from))
        (robot_at ?r ?to)
        (carrier_at ?k ?to)    
    )
)
;send robot ?r and carrier ?k back to base (depot)
(:action back_to_base
    :parameters (?from - loc ?to - base ?r - robot ?k - carrier)
    :precondition (and 
        (robot_at ?r ?from)
        (carrier_at ?k ?from)
        ;(at start (=(crate_count ?k)0)) ;cannot use ADLs
        (crate_count ?k n0)      ;setting crate amount to initial number (n0) for carrier ?k
    )
    :effect(and
        (not (robot_at ?r ?from))
        (not (carrier_at ?k ?from))
        (robot_at ?r ?to)
        (carrier_at ?k ?to)
    )   
)
;load (generic) crate ?c onto robot ?r at location ?l
(:action load_crate
    :parameters (?depot - base ?c - crate ?r - robot ?k - carrier ?init_amount ?final_amount - amount)
    :precondition (and
        (robot_at ?r ?depot)
        (carrier_at ?k ?depot)
        (crate_at ?c ?depot)
        ;(add ?init_amount ?final_amount) ;updating initial and final heaps, essential for counting crates
        (not (bearing ?k ?c))
        (not (is_delivered ?c))
        (crate_count ?k ?init_amount)    ;this prevents multiple robots to load multiple crates at a time
    
    )
    :effect (and
        (bearing ?k ?c)
        (not (crate_at ?c ?depot))
        (is_empty ?r)
        (not (crate_count ?k ?init_amount))
        (add ?init_amount ?final_amount)
        (crate_count ?k ?final_amount)
             
    )
)

;;deliver (generic) crate ?c to location ?l to person ?p
(:action deliver_crate
    :parameters (?r - robot ?c - crate ?to - loc ?p - person ?k - carrier ?init_amount ?final_amount - amount)
    :precondition (and 
        (robot_at ?r ?to)
        (carrier_at ?k ?to)
        (person_at ?p ?to)
        (not (is_delivered ?c))
        ;(is_loaded ?c)
        ;(contains ?c ?cont)
        ;(at start (not(is_delivered ?c)))
        (bearing ?k ?c)
        ;(at start (>(crate_count ?k)0))    ;cannot use ADLs
        (pop ?init_amount ?final_amount)
        (crate_count ?k ?init_amount)    ;this prevents multiple robots to deliver multiple crates at a time
    )
    :effect (and
       ;(not(is_loaded ?c))
       (is_delivered ?c)
       (served ?p ?c)
       (not(bearing ?k ?c))
       (crate_at ?c ?to)
       (not (crate_count ?k ?init_amount))
       (crate_count ?k ?final_amount)

    )
)
)

; problem
(define (problem problem2_no_fluents) (:domain normalDelivery_no_fluents)
(:objects
    l1 l2 l3 l4 l5 l6 l7 - loc
    matteo alice francesco eliana giorgio - person
    f1 f2 f3 f4 - food
    m1 m2 m3 - meds
    carrier - carrier

    ;adding amount objects
    n1 n2 n3 n4 - amount
)

(:init
    ;crates location
    (crate_at f1 depot)
    (crate_at f2 depot)
    (crate_at f3 depot)
    (crate_at f4 depot)
    (crate_at m1 depot)
    (crate_at m2 depot)
    (crate_at m3 depot)


    ;robot location
    (robot_at operator depot)
    (is_empty operator)

    ;carrier location
    (carrier_at carrier depot)
    ;initialize carrier crate_count
    (crate_count carrier n0)            ;resets the counter

    ;people location
    (person_at matteo l1)
    (person_at eliana l2)
    (person_at francesco l2)
    (person_at alice l7)
    (person_at giorgio l3)

    ;every person is not served
    
    
    

    ;add-pop relationships: \ref{elevator problem}
    (add n0 n1)
    (add n1 n2)
    (add n2 n3)
    (add n3 n4)

    (pop n4 n3)
    (pop n3 n2)
    (pop n2 n1)
    (pop n1 n0)


)

(:goal (and
    
    ;Eliana needs food
    (or (served eliana f1)(served eliana f2)(served eliana f3)(served eliana f4))
    ;(exists (?c - food) (and (served eliana ?c)))


    
    ;Matteo needs 2 crates of meds
    (or (served matteo f1)(served matteo f2)(served matteo f3)(served matteo f4))
    (or (served matteo m1)(served matteo m2)(served matteo m3))
    ;(exists (?c - meds) (and (served matteo ?c)))
    

    ;Francesco needs both food and meds
    (or (served francesco m1)(served francesco m2)(served francesco m3))
    (or(served francesco m1)(served francesco m2)(served francesco m3))
    ;(exists (?c - meds) (and (served francesco ?c)))
    ;(exists (?c - food) (and (served francesco ?c)))

    ;Alice needs meds
    (or (served alice f1)(served alice f2)(served alice f3)(served alice f4))
    ;(exists (?c - meds) (and (served alice ?c)))
))

)

; plan
1. (load_crate depot f1 operator carrier n0 n1)
   deleted: (crate_at f1 depot) (crate_count carrier n0)
   added: (bearing carrier f1) (crate_count carrier n1)
   goals met: 0 of 6
2. (load_crate depot m1 operator carrier n1 n2)
   deleted: (crate_at m1 depot) (crate_count carrier n1)
   added: (bearing carrier m1) (crate_count carrier n2)
   goals met: 0 of 6
3. (move operator carrier depot l1)
   deleted: (robot_at operator depot) (carrier_at carrier depot)
   added: (robot_at operator l1) (carrier_at carrier l1)
   goals met: 0 of 6
4. (deliver_crate operator f1 l1 matteo carrier n2 n1)
   deleted: (bearing carrier f1) (crate_count carrier n2)
   added: (is_delivered f1) (served matteo f1) (crate_at f1 l1) (crate_count carrier n1)
   goals met: 1 of 6
5. (deliver_crate operator m1 l1 matteo carrier n1 n0)
   deleted: (bearing carrier m1) (crate_count carrier n1)
   added: (is_delivered m1) (served matteo m1) (crate_at m1 l1) (crate_count carrier n0)
   goals met: 2 of 6
6. (back_to_base l1 depot operator carrier)
   deleted: (robot_at operator l1) (carrier_at carrier l1)
   added: (robot_at operator depot) (carrier_at carrier depot)
   goals met: 2 of 6
7. (load_crate depot f2 operator carrier n0 n1)
   deleted: (crate_at f2 depot) (crate_count carrier n0)
   added: (bearing carrier f2) (crate_count carrier n1)
   goals met: 2 of 6
8. (load_crate depot m2 operator carrier n1 n0)
   deleted: (crate_at m2 depot) (crate_count carrier n1)
   added: (bearing carrier m2) (add n1 n0) (crate_count carrier n0)
   goals met: 2 of 6
9. (load_crate depot f3 operator carrier n0 n4)
   deleted: (crate_at f3 depot) (crate_count carrier n0)
   added: (bearing carrier f3) (add n0 n4) (crate_count carrier n4)
   goals met: 2 of 6
10. (move operator carrier depot l2)
   deleted: (robot_at operator depot) (carrier_at carrier depot)
   added: (robot_at operator l2) (carrier_at carrier l2)
   goals met: 2 of 6
11. (deliver_crate operator f2 l2 eliana carrier n4 n3)
   deleted: (bearing carrier f2) (crate_count carrier n4)
   added: (is_delivered f2) (served eliana f2) (crate_at f2 l2) (crate_count carrier n3)
   goals met: 3 of 6
12. (deliver_crate operator m2 l2 francesco carrier n3 n2)
   deleted: (bearing carrier m2) (crate_count carrier n3)
   added: (is_delivered m2) (served francesco m2) (crate_at m2 l2) (crate_count carrier n2)
   goals met: 5 of 6
13. (move operator carrier l2 l7)
   deleted: (robot_at operator l2) (carrier_at carrier l2)
   added: (robot_at operator l7) (carrier_at carrier l7)
   goals met: 5 of 6
14. (deliver_crate operator f3 l7 alice carrier n2 n1)
   deleted: (bearing carrier f3) (crate_count carrier n2)
   added: (is_delivered f3) (served alice f3) (crate_at f3 l7) (crate_count carrier n1)
   goals met: 6 of 6
